```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/0b86fd72-bddc-4ea8-8c34-4b9bb3463b3d/terraform-bin state list
[31mNo state file was found!

State management commands require a state file. Run this command
in a directory where Terraform has been run or use the -state flag
to point the command to a specific state location.[0m[0m
::debug::Terraform exited with code 1.
::debug::stdout: 
::debug::stderr: [31mNo state file was found!%0A%0AState management commands require a state file. Run this command%0Ain a directory where Terraform has been run or use the -state flag%0Ato point the command to a specific state location.[0m[0m%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.
[command]/usr/local/vss-agent/2.309.0/_work/_temp/0b86fd72-bddc-4ea8-8c34-4b9bb3463b3d/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be created
  + resource "azurerm_container_registry" "this" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "avmtelemetry"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = [
          + {
              + default_action  = "Deny"
              + ip_rule         = [
                  + {
                      + action   = "Allow"
                      + ip_range = "52.188.252.35/32"
                    },
                ]
              + virtual_network = [
                  + {
                      + action    = "Allow"
                      + subnet_id = (known after apply)
                    },
                ]
            },
        ]
      + public_network_access_enabled = true
      + resource_group_name           = "avm-telemetry"
      + retention_policy              = (known after apply)
      + sku                           = "Premium"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_container_registry_token.pull will be created
  + resource "azurerm_container_registry_token" "pull" {
      + container_registry_name = "avmtelemetry"
      + enabled                 = true
      + id                      = (known after apply)
      + name                    = "pull-token"
      + resource_group_name     = "avm-telemetry"
      + scope_map_id            = (known after apply)
    }

  # module.acr.azurerm_container_registry_token.push will be created
  + resource "azurerm_container_registry_token" "push" {
      + container_registry_name = "avmtelemetry"
      + enabled                 = true
      + id                      = (known after apply)
      + name                    = "push-token"
      + resource_group_name     = "avm-telemetry"
      + scope_map_id            = (known after apply)
    }

  # module.acr.azurerm_container_registry_token_password.pull_password will be created
  + resource "azurerm_container_registry_token_password" "pull_password" {
      + container_registry_token_id = (known after apply)
      + id                          = (known after apply)

      + password1 {
          + value = (sensitive value)
        }
    }

  # module.acr.azurerm_container_registry_token_password.push_password will be created
  + resource "azurerm_container_registry_token_password" "push_password" {
      + container_registry_token_id = (known after apply)
      + id                          = (known after apply)

      + password1 {
          + value = (sensitive value)
        }
    }

  # module.acr.azurerm_private_dns_a_record.data will be created
  + resource "azurerm_private_dns_a_record" "data" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "avmtelemetry.eastus.data"
      + records             = (known after apply)
      + resource_group_name = "avm-telemetry"
      + ttl                 = 3600
      + zone_name           = "privatelink.azurecr.io"
    }

  # module.acr.azurerm_private_dns_a_record.login_server will be created
  + resource "azurerm_private_dns_a_record" "login_server" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "avmtelemetry"
      + records             = (known after apply)
      + resource_group_name = "avm-telemetry"
      + ttl                 = 3600
      + zone_name           = "privatelink.azurecr.io"
    }

  # module.acr.azurerm_private_dns_zone.pdz will be created
  + resource "azurerm_private_dns_zone" "pdz" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "avm-telemetry"
    }

  # module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink_private" {
      + id                    = (known after apply)
      + name                  = "mydnslink"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "avm-telemetry"
      + virtual_network_id    = (known after apply)
    }

  # module.acr.azurerm_private_endpoint.pep will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "mype"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "avm-telemetry"
      + subnet_id                = (known after apply)

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "countainerregistryprivatelink"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.acr.azurerm_subnet.acr will be created
  + resource "azurerm_subnet" "acr" {
      + address_prefixes                               = [
          + "192.168.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "acr"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "avm-telemetry"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "telemetry"
    }

  # module.acr.azurerm_subnet.container_apps will be created
  + resource "azurerm_subnet" "container_apps" {
      + address_prefixes                               = [
          + "192.168.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "containerapps"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "avm-telemetry"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "telemetry"
    }

  # module.acr.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "telemetry"
      + resource_group_name = "avm-telemetry"
      + subnet              = (known after apply)
    }

  # module.container_apps.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "avm-telemetry"
      + resource_group_name                   = "avm-telemetry"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # module.container_apps.local_file.ingress_url will be created
  + resource "local_file" "ingress_url" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "container_apps/ingress"
      + id                   = (known after apply)
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = (known after apply)
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash" = "100a9d3f0e4fc1f2a80bbc6b969670c4"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = (known after apply)
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = (known after apply)
      + sha256_digest        = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "avm-telemetry"
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"] will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "telemetry-proxy"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "avm-telemetry"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "secname"
          + server               = (known after apply)
          + username             = "pull-token"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = (known after apply)
              + memory            = "0.5Gi"
              + name              = "telemetry-proxy"

              + env {
                  + name        = "INSTRUMENTATION_KEY"
                  + secret_name = "ikey"
                }
              + env {
                  + name  = "PORT"
                  + value = "8080"
                }
            }
        }
    }

  # module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env will be created
  + resource "azurerm_container_app_environment" "container_env" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "telemetry-proxy"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "avm-telemetry"
      + static_ip_address                = (known after apply)
    }

  # module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0] will be created
  + resource "azurerm_log_analytics_workspace" "laws" {
      + allow_resource_only_permissions = true
      + cmk_for_query_forced            = false
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "telemetry-proxy-log-analytics-workspace"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "avm-telemetry"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

Plan: 21 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "pull" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_pull"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "push" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_push"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.azurerm_container_registry.this will be created%0A  + resource "azurerm_container_registry" "this" {%0A      + admin_enabled                 = false%0A      + admin_password                = (sensitive value)%0A      + admin_username                = (known after apply)%0A      + encryption                    = (known after apply)%0A      + export_policy_enabled         = true%0A      + id                            = (known after apply)%0A      + location                      = "eastus"%0A      + login_server                  = (known after apply)%0A      + name                          = "avmtelemetry"%0A      + network_rule_bypass_option    = "AzureServices"%0A      + network_rule_set              = [%0A          + {%0A              + default_action  = "Deny"%0A              + ip_rule         = [%0A                  + {%0A                      + action   = "Allow"%0A                      + ip_range = "52.188.252.35/32"%0A                    },%0A                ]%0A              + virtual_network = [%0A                  + {%0A                      + action    = "Allow"%0A                      + subnet_id = (known after apply)%0A                    },%0A                ]%0A            },%0A        ]%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "avm-telemetry"%0A      + retention_policy              = (known after apply)%0A      + sku                           = "Premium"%0A      + trust_policy                  = (known after apply)%0A      + zone_redundancy_enabled       = false%0A    }%0A%0A  # module.acr.azurerm_container_registry_token.pull will be created%0A  + resource "azurerm_container_registry_token" "pull" {%0A      + container_registry_name = "avmtelemetry"%0A      + enabled                 = true%0A      + id                      = (known after apply)%0A      + name                    = "pull-token"%0A      + resource_group_name     = "avm-telemetry"%0A      + scope_map_id            = (known after apply)%0A    }%0A%0A  # module.acr.azurerm_container_registry_token.push will be created%0A  + resource "azurerm_container_registry_token" "push" {%0A      + container_registry_name = "avmtelemetry"%0A      + enabled                 = true%0A      + id                      = (known after apply)%0A      + name                    = "push-token"%0A      + resource_group_name     = "avm-telemetry"%0A      + scope_map_id            = (known after apply)%0A    }%0A%0A  # module.acr.azurerm_container_registry_token_password.pull_password will be created%0A  + resource "azurerm_container_registry_token_password" "pull_password" {%0A      + container_registry_token_id = (known after apply)%0A      + id                          = (known after apply)%0A%0A      + password1 {%0A          + value = (sensitive value)%0A        }%0A    }%0A%0A  # module.acr.azurerm_container_registry_token_password.push_password will be created%0A  + resource "azurerm_container_registry_token_password" "push_password" {%0A      + container_registry_token_id = (known after apply)%0A      + id                          = (known after apply)%0A%0A      + password1 {%0A          + value = (sensitive value)%0A        }%0A    }%0A%0A  # module.acr.azurerm_private_dns_a_record.data will be created%0A  + resource "azurerm_private_dns_a_record" "data" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "avmtelemetry.eastus.data"%0A      + records             = (known after apply)%0A      + resource_group_name = "avm-telemetry"%0A      + ttl                 = 3600%0A      + zone_name           = "privatelink.azurecr.io"%0A    }%0A%0A  # module.acr.azurerm_private_dns_a_record.login_server will be created%0A  + resource "azurerm_private_dns_a_record" "login_server" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = "avmtelemetry"%0A      + records             = (known after apply)%0A      + resource_group_name = "avm-telemetry"%0A      + ttl                 = 3600%0A      + zone_name           = "privatelink.azurecr.io"%0A    }%0A%0A  # module.acr.azurerm_private_dns_zone.pdz will be created%0A  + resource "azurerm_private_dns_zone" "pdz" {%0A      + id                                                    = (known after apply)%0A      + max_number_of_record_sets                             = (known after apply)%0A      + max_number_of_virtual_network_links                   = (known after apply)%0A      + max_number_of_virtual_network_links_with_registration = (known after apply)%0A      + name                                                  = "privatelink.azurecr.io"%0A      + number_of_record_sets                                 = (known after apply)%0A      + resource_group_name                                   = "avm-telemetry"%0A    }%0A%0A  # module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private will be created%0A  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink_private" {%0A      + id                    = (known after apply)%0A      + name                  = "mydnslink"%0A      + private_dns_zone_name = "privatelink.azurecr.io"%0A      + registration_enabled  = false%0A      + resource_group_name   = "avm-telemetry"%0A      + virtual_network_id    = (known after apply)%0A    }%0A%0A  # module.acr.azurerm_private_endpoint.pep will be created%0A  + resource "azurerm_private_endpoint" "pep" {%0A      + custom_dns_configs       = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "eastus"%0A      + name                     = "mype"%0A      + network_interface        = (known after apply)%0A      + private_dns_zone_configs = (known after apply)%0A      + resource_group_name      = "avm-telemetry"%0A      + subnet_id                = (known after apply)%0A%0A      + private_service_connection {%0A          + is_manual_connection           = false%0A          + name                           = "countainerregistryprivatelink"%0A          + private_connection_resource_id = (known after apply)%0A          + private_ip_address             = (known after apply)%0A          + subresource_names              = [%0A              + "registry",%0A            ]%0A        }%0A    }%0A%0A  # module.acr.azurerm_subnet.acr will be created%0A  + resource "azurerm_subnet" "acr" {%0A      + address_prefixes                               = [%0A          + "192.168.0.0/23",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "acr"%0A      + private_endpoint_network_policies_enabled      = false%0A      + private_link_service_network_policies_enabled  = false%0A      + resource_group_name                            = "avm-telemetry"%0A      + service_endpoints                              = [%0A          + "Microsoft.ContainerRegistry",%0A        ]%0A      + virtual_network_name                           = "telemetry"%0A    }%0A%0A  # module.acr.azurerm_subnet.container_apps will be created%0A  + resource "azurerm_subnet" "container_apps" {%0A      + address_prefixes                               = [%0A          + "192.168.2.0/23",%0A        ]%0A      + enforce_private_link_endpoint_network_policies = (known after apply)%0A      + enforce_private_link_service_network_policies  = (known after apply)%0A      + id                                             = (known after apply)%0A      + name                                           = "containerapps"%0A      + private_endpoint_network_policies_enabled      = false%0A      + private_link_service_network_policies_enabled  = false%0A      + resource_group_name                            = "avm-telemetry"%0A      + service_endpoints                              = [%0A          + "Microsoft.ContainerRegistry",%0A        ]%0A      + virtual_network_name                           = "telemetry"%0A    }%0A%0A  # module.acr.azurerm_virtual_network.vnet will be created%0A  + resource "azurerm_virtual_network" "vnet" {%0A      + address_space       = [%0A          + "192.168.0.0/16",%0A        ]%0A      + dns_servers         = (known after apply)%0A      + guid                = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "eastus"%0A      + name                = "telemetry"%0A      + resource_group_name = "avm-telemetry"%0A      + subnet              = (known after apply)%0A    }%0A%0A  # module.container_apps.azurerm_application_insights.this will be created%0A  + resource "azurerm_application_insights" "this" {%0A      + app_id                                = (known after apply)%0A      + application_type                      = "other"%0A      + connection_string                     = (sensitive value)%0A      + daily_data_cap_in_gb                  = (known after apply)%0A      + daily_data_cap_notifications_disabled = (known after apply)%0A      + disable_ip_masking                    = false%0A      + force_customer_storage_for_profiler   = false%0A      + id                                    = (known after apply)%0A      + instrumentation_key                   = (sensitive value)%0A      + internet_ingestion_enabled            = true%0A      + internet_query_enabled                = true%0A      + local_authentication_disabled         = false%0A      + location                              = "eastus"%0A      + name                                  = "avm-telemetry"%0A      + resource_group_name                   = "avm-telemetry"%0A      + retention_in_days                     = 90%0A      + sampling_percentage                   = 100%0A    }%0A%0A  # module.container_apps.local_file.ingress_url will be created%0A  + resource "local_file" "ingress_url" {%0A      + content              = (known after apply)%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "container_apps/ingress"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = (known after apply)%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash" = "100a9d3f0e4fc1f2a80bbc6b969670c4"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = (known after apply)%0A        }%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy will be created%0A  + resource "docker_registry_image" "proxy" {%0A      + id                   = (known after apply)%0A      + insecure_skip_verify = false%0A      + keep_remotely        = true%0A      + name                 = (known after apply)%0A      + sha256_digest        = (known after apply)%0A    }%0A%0A  # module.resource_group.azurerm_resource_group.this will be created%0A  + resource "azurerm_resource_group" "this" {%0A      + id       = (known after apply)%0A      + location = "eastus"%0A      + name     = "avm-telemetry"%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"] will be created%0A  + resource "azurerm_container_app" "container_app" {%0A      + container_app_environment_id  = (known after apply)%0A      + custom_domain_verification_id = (sensitive value)%0A      + id                            = (known after apply)%0A      + latest_revision_fqdn          = (known after apply)%0A      + latest_revision_name          = (known after apply)%0A      + location                      = (known after apply)%0A      + name                          = "telemetry-proxy"%0A      + outbound_ip_addresses         = (known after apply)%0A      + resource_group_name           = "avm-telemetry"%0A      + revision_mode                 = "Single"%0A%0A      + ingress {%0A          + allow_insecure_connections = false%0A          + external_enabled           = true%0A          + fqdn                       = (known after apply)%0A          + target_port                = 8080%0A          + transport                  = "auto"%0A%0A          + traffic_weight {%0A              + latest_revision = true%0A              + percentage      = 100%0A            }%0A        }%0A%0A      + registry {%0A          + password_secret_name = "secname"%0A          + server               = (known after apply)%0A          + username             = "pull-token"%0A        }%0A%0A      + secret {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A      + secret {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A%0A      + template {%0A          + max_replicas    = 10%0A          + min_replicas    = (known after apply)%0A          + revision_suffix = (known after apply)%0A%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = (known after apply)%0A              + memory            = "0.5Gi"%0A              + name              = "telemetry-proxy"%0A%0A              + env {%0A                  + name        = "INSTRUMENTATION_KEY"%0A                  + secret_name = "ikey"%0A                }%0A              + env {%0A                  + name  = "PORT"%0A                  + value = "8080"%0A                }%0A            }%0A        }%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env will be created%0A  + resource "azurerm_container_app_environment" "container_env" {%0A      + default_domain                   = (known after apply)%0A      + docker_bridge_cidr               = (known after apply)%0A      + id                               = (known after apply)%0A      + infrastructure_subnet_id         = (known after apply)%0A      + internal_load_balancer_enabled   = false%0A      + location                         = "eastus"%0A      + log_analytics_workspace_id       = (known after apply)%0A      + name                             = "telemetry-proxy"%0A      + platform_reserved_cidr           = (known after apply)%0A      + platform_reserved_dns_ip_address = (known after apply)%0A      + resource_group_name              = "avm-telemetry"%0A      + static_ip_address                = (known after apply)%0A    }%0A%0A  # module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0] will be created%0A  + resource "azurerm_log_analytics_workspace" "laws" {%0A      + allow_resource_only_permissions = true%0A      + cmk_for_query_forced            = false%0A      + daily_quota_gb                  = -1%0A      + id                              = (known after apply)%0A      + internet_ingestion_enabled      = true%0A      + internet_query_enabled          = true%0A      + local_authentication_disabled   = false%0A      + location                        = "eastus"%0A      + name                            = "telemetry-proxy-log-analytics-workspace"%0A      + primary_shared_key              = (sensitive value)%0A      + resource_group_name             = "avm-telemetry"%0A      + retention_in_days               = (known after apply)%0A      + secondary_shared_key            = (sensitive value)%0A      + sku                             = "PerGB2018"%0A      + workspace_id                    = (known after apply)%0A    }%0A%0APlan: 21 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```